package sem1;

/*
  sem1Task01
  добавить на экран компоновщик-сетку с одним столбцом и добавить над существующей кнопкой следующие
  компоненты в заданном порядке: JLabel с заголовком «Выберите режим игры», сгруппированные в ButtonGroup
  переключаемые JRadioButton с указанием режимов «Человек против компьютера» и «Человек против человека»,
  JLabel с заголовком «Выберите размеры поля», JLabel с заголовком «Установленный размер поля:»,
  JSlider со значениями 3..10, JLabel с заголовком «Выберите длину для победы», JLabel с заголовком
  «Установленная длина:», JSlider со значениями 3..10.
 */

/*
 sem1Task02
 Создать окно клиента чата. Окно должно содержать JtextField
 для ввода логина, пароля, IP-адреса сервера, порта подключения
 к серверу, область ввода сообщений, JTextArea область просмотра
 сообщений чата и JButton подключения к серверу и отправки сообщения
 в чат. Желательно сразу сгруппировать компоненты, относящиеся к
 серверу сгруппировать на JPanel сверху экрана, а компоненты,
 относящиеся к отправке сообщения – на JPanel снизу.
 */

public class Main {
    public static void main(String[] args) {
        new GameWindow();
        System.out.println("Method main() is over");
    }
}
